W7D2/music-app/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "HeIXauY0IYNRSITS0cDRiQ"], ["updated_at", "2021-01-05 22:00:52.668775"], ["id", 10]]
---
  def reset_session_token
    self.session_token = SecureRandom::urlsafe_base64
    self.save! #fail loud