W11D1/todos/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id", 1612231378444], ["title", "afaf"], ["created_at", "2021-02-02 02:03:00.195978"], ["updated_at", "2021-02-02 02:03:00.195978"]]
---
    def create
        @todo = Todo.new(todo_params)
        if @todo.save