W8D1/reddit-rails/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Josh is the greatest"], ["description", "Because reasons"], ["user_id", 1], ["created_at", "2021-01-11 19:23:22.303047"], ["updated_at", "2021-01-11 19:23:22.303047"]]
---
  def create
    @sub = current_user.subs.create(sub_params)