W8D1/reddit-rails/app/controllers/users_controller.rb

    def create
        @user = User.create(user_params)

        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "YhbxeD3nNETUai3rl3azICItohWtimKkDZcMEwyvi6JsV6gd92ZZPI3ltlVFaka0/o2YKbdIDT6NGTBQso+vJA=="], ["updated_at", "2021-01-11 19:13:39.758791"], ["id", 1]]

    def update
        @user = User.find_by(id: params[:id])
        if @user && @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "KingApe"], ["password_digest", "$2a$12$LBMKuU29eNMMJDOGYTjjROQmWPH4BYujm6dqvkEhZ3BFKxDce5eSy"], ["updated_at", "2021-01-11 19:19:01.607331"], ["id", 1]]