W6D2_W6D3/artshare/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 2], ["LIMIT", 1]]
---
  def index
    # user_artworks = Artwork.find_by(artist_id: params[:user_id])
    user_artworks = Artwork.where(artist_id: params[:user_id])

INSERT INTO "artworks" ("title", "artist_id", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Impression"], ["artist_id", 2], ["image_url", "imp"], ["created_at", "2020-12-30 23:34:31.331124"], ["updated_at", "2020-12-30 23:34:31.331124"]]
---
  def create
    artwork = Artwork.new(artwork_params)
    if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["artist_id", 3], ["updated_at", "2020-12-30 23:36:09.408261"], ["id", 5]]
---
  def update
    artwork = Artwork.find(params[:id])
    if artwork.update_attributes(artwork_params)