W6D5/cats_99/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
  def index
    cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    cat = Cat.find_by(id: params[:id])

INSERT INTO "cats" ("color", "name", "sex", "description", "created_at", "updated_at", "birth_date") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    cat = Cat.new(cat_params)

    if cat.save