W7D2/music-app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "HeIXauY0IYNRSITS0cDRiQ"], ["updated_at", "2021-01-05 22:00:52.668775"], ["id", 10]]
---
  def create
    @user = User.create(user_params)
    if @user.save!